---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.RoundDuctSizePrefix
source: html/d1f1f1df-ff92-8640-4aa1-72dd2ef1114c.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.RoundDuctSizePrefix Property

The round duct size prefix string.

## Syntax (C#)
```csharp
public string RoundDuctSizePrefix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null